app/controllers/posts_controller.rb

  def index
    @post = Post.new
    @posts = Post.all
---
SELECT "posts".* FROM "posts"

  def create
    # @post = Post.new(post_params)
    @post = current_user.post.build(post_params)
    if @post.save
---
INSERT INTO "posts" ("body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["body", "hoge"], ["created_at", "2014-07-14 10:42:42.150244"], ["updated_at", "2014-07-14 10:42:42.150244"], ["user_id", 1]]