app/controllers/sessions_controller.rb

  def create
    @user = User.find_by(email: params[:user][:email])
---
SELECT  "users".* FROM "users"  WHERE "users"."email" = 'champion.is.acmilan@gmail.com' LIMIT 1